ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_UsbDevice.cpp
// Copyright Microsoft Corporation
// Copyright GHI Electronics, LLC
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <string.h>
#include "LPC17.h"
#include "../../Drivers/USBClient/USBClient.h"

///////////////////////////////////////////////////////////////////////////////////////////
/// LPC17 USB Hardware state
///////////////////////////////////////////////////////////////////////////////////////////
/* Device Interrupt Bit Definitions */
#define FRAME_INT           0x00000001
#define EP_FAST_INT         0x00000002
#define EP_SLOW_INT         0x00000004
#define DEV_STAT_INT        0x00000008
#define CCEMTY_INT          0x00000010
#define CDFULL_INT          0x00000020
#define RxENDPKT_INT        0x00000040
#define TxENDPKT_INT        0x00000080
#define EP_RLZED_INT        0x00000100
#define ERR_INT             0x00000200

/* Rx & Tx Packet Length Definitions */
#define PKT_LNGTH_MASK      0x000003FF
#define PKT_DV              0x00000400
#define PKT_RDY             0x00000800

/* USB Control Definitions */
#define CTRL_RD_EN          0x00000001
#define CTRL_WR_EN          0x00000002

/* Command Codes */
#define CMD_SET_ADDR        0x00D00500
#define CMD_CFG_DEV         0x00D80500
#define CMD_SET_MODE        0x00F30500
#define CMD_RD_FRAME        0x00F50500
#define DAT_RD_FRAME        0x00F50200
#define CMD_RD_TEST         0x00FD0500
#define DAT_RD_TEST         0x00FD0200
#define CMD_SET_DEV_STAT    0x00FE0500
#define CMD_GET_DEV_STAT    0x00FE0500
#define DAT_GET_DEV_STAT    0x00FE0200
#define CMD_GET_ERR_CODE    0x00FF0500
#define DAT_GET_ERR_CODE    0x00FF0200
#define CMD_RD_ERR_STAT     0x00FB0500
#define DAT_RD_ERR_STAT     0x00FB0200
#define DAT_WR_BYTE(x)     (0x00000100 | ((x) << 16))
#define CMD_SEL_EP(x)      (0x00000500 | ((x) << 16))
#define DAT_SEL_EP(x)      (0x00000200 | ((x) << 16))
#define CMD_SEL_EP_CLRI(x) (0x00400500 | ((x) << 16))
#define DAT_SEL_EP_CLRI(x) (0x00400200 | ((x) << 16))
#define CMD_SET_EP_STAT(x) (0x00400500 | ((x) << 16))
#define CMD_CLR_BUF         0x00F20500
#define DAT_CLR_BUF         0x00F20200
#define CMD_VALID_BUF       0x00FA0500

/* Device address Register Definitions */
#define DEV_ADDR_MASK       0x7F
#define DEV_EN              0x80

/* Device Configure Register Definitions */
#define CONF_DVICE          0x01

/* Device Mode Register Definitions */
#define AP_CLK              0x01
#define INAK_CI             0x02
#define INAK_CO             0x04
#define INAK_II             0x08
#define INAK_IO             0x10
#define INAK_BI             0x20
#define INAK_BO             0x40

/* Device Status Register Definitions */
#define DEV_CON             0x01
#define DEV_CON_CH          0x02
#define DEV_SUS             0x04
#define DEV_SUS_CH          0x08
#define DEV_RST             0x10

/* Error Code Register Definitions */
#define ERR_EC_MASK         0x0F
#define ERR_EA              0x10

/* Error Status Register Definitions */
#define ERR_PID             0x01
#define ERR_UEPKT           0x02
#define ERR_DCRC            0x04
#define ERR_TIMOUT          0x08
#define ERR_EOP             0x10
#define ERR_B_OVRN          0x20
#define ERR_BTSTF           0x40
#define ERR_TGL             0x80

/* Endpoint Select Register Definitions */
#define EP_SEL_F            0x01
#define EP_SEL_ST           0x02
#define EP_SEL_STP          0x04
#define EP_SEL_PO           0x08
#define EP_SEL_EPN          0x10
#define EP_SEL_B_1_FULL     0x20
#define EP_SEL_B_2_FULL     0x40

/* Endpoint Status Register Definitions */
#define EP_STAT_ST          0x01
#define EP_STAT_DA          0x20
#define EP_STAT_RF_MO       0x40
#define EP_STAT_CND_ST      0x80

/* USB registers*/
#define OTGStCtrl (*(volatile uint32_t *)0x2008C110)

#define USBDevIntSt (*(volatile uint32_t *)0x2008C200)
#define USBDevIntEn (*(volatile uint32_t *)0x2008C204)
#define USBDevIntClr (*(volatile uint32_t *)0x2008C208)

#define USBCmdCode (*(volatile uint32_t *)0x2008C210)
#define USBCmdData (*(volatile uint32_t *)0x2008C214)

#define USBRxData (*(volatile uint32_t *)0x2008C218)
#define USBTxData (*(volatile uint32_t *)0x2008C21C)
#define USBRxPLen (*(volatile uint32_t *)0x2008C220)
#define USBTxPLen (*(volatile uint32_t *)0x2008C224)

#define USBCtrl (*(volatile uint32_t *)0x2008C228)

#define USBEpIntSt (*(volatile uint32_t *)0x2008C230)
#define USBEpIntEn (*(volatile uint32_t *)0x2008C234)
#define USBEpIntClr (*(volatile uint32_t *)0x2008C238)
#define USBEpIntSet (*(volatile uint32_t *)0x2008C23C)

#define USBReEp (*(volatile uint32_t *)0x2008C244)
#define USBEpInd (*(volatile uint32_t *)0x2008C248)

#define USBEpMaxPSize (*(volatile uint32_t *)0x2008C24C)

#define USBClkCtrl (*(volatile uint32_t *)0x2008CFF4)
#define USBClkSt (*(volatile uint32_t *)0x2008CFF8)
#define OTGClkCtrl (*(volatile uint32_t *)0x2008CFF4)
#define OTGClkSt (*(volatile uint32_t *)0x2008CFF8)

struct UsbDeviceDriver {
    UsClientState *usClientState;

    bool txRunning[LPC17_USB_ENDPOINT_COUNT];
    bool txNeedZLPS[LPC17_USB_ENDPOINT_COUNT];

    uint8_t previousDeviceState;
    bool firstDescriptorPacket;
};

UsbDeviceDriver usbDeviceDrivers[LPC17_TOTAL_USB_CONTROLLERS];

union EndpointConfiguration {
    struct {
        unsigned EE : 1;      // Endpoint enable (1 = enable)
        unsigned DE : 1;      // Double buffer enable (1 = double buffered)
        unsigned MPS : 10;      // Maximum packet size (iso=1-1023, blk=8,16,32,64, int32_t=1-64
        unsigned ED : 1;      // Endpoint direction (1 = IN)
        unsigned ET : 2;      // Endpoint type (1=iso, 2=blk, 3=int32_t)
        unsigned EN : 4;      // Endpoint number (1-15)
        unsigned AISN : 3;      // Alternate Interface number
        unsigned IN : 3;      // Interface number
        unsigned CN : 2;      // configuration number
    } bits;
    uint32_t word;
};

