ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_UsbDevice.cpp
static EndpointConfiguration EndpointInit[LPC17_USB_ENDPOINT_COUNT];     // Corresponds to endpoint configuration RAM at LPC17xx_USB::UDCCRx
static int32_t nacking_rx_OUT_data[LPC17_USB_ENDPOINT_COUNT];

bool LPC17_UsbDevice_ProtectPins(int32_t controllerIndex, bool On);
void LPC17_UsbDevice_InterruptHandler(void* param);
void LPC17_UsbDevice_TxPacket(UsClientState* usClientState, int32_t endpoint);
void LPC17_UsbDevice_ProcessEP0(UsClientState* usClientState, int32_t in, int32_t setup);
void LPC17_UsbDevice_ProcessEndPoint(UsClientState* usClientState, int32_t ep, int32_t in);
void LPC17_UsbDevice_Enpoint_TxInterruptHandler(UsClientState* usClientState, uint32_t endpoint);
void LPC17_UsbDevice_Enpoint_RxInterruptHandler(UsClientState* usClientState, uint32_t endpoint);
void LPC17_UsbDevice_ResetEvent(UsClientState* usClientState);
void LPC17_UsbDevice_SuspendEvent(UsClientState* usClientState);
void LPC17_UsbDevice_ResumeEvent(UsClientState* usClientState);
void LPC17_UsbDevice_ControlNext(UsClientState* usClientState);
uint32_t LPC17_UsbDevice_EPAdr(uint32_t EPNum, int8_t in);

void LPC17_UsbDevice_AddApi(const TinyCLR_Api_Manager* apiManager) {
    TinyCLR_UsbClient_AddApi(apiManager);

}
const TinyCLR_Api_Info* LPC17_UsbDevice_GetRequiredApi() {
    return TinyCLR_UsbClient_GetRequiredApi();
}

void LPC17_UsbDevice_Reset() {
    return TinyCLR_UsbClient_Reset(0);
}

void LPC17_UsbDevice_InitializeConfiguration(UsClientState *usClientState) {
    int32_t controllerIndex = 0;

    if (usClientState != nullptr) {
        usClientState->controllerIndex = controllerIndex;

        usClientState->maxFifoPacketCount = LPC17_USB_PACKET_FIFO_COUNT;
        usClientState->totalEndpointsCount = LPC17_USB_ENDPOINT_COUNT;
        usClientState->totalPipesCount = LPC17_USB_PIPE_COUNT;

        // Update endpoint size DeviceDescriptor Configuration if device value is different to default value
        usClientState->deviceDescriptor.MaxPacketSizeEp0 = TinyCLR_UsbClient_GetEndpointSize(0);

        usbDeviceDrivers[controllerIndex].usClientState = usClientState;
    }
}

bool LPC17_UsbDevice_Initialize(UsClientState *usClientState) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    if (usClientState == nullptr)
        return false;

    int32_t controllerIndex = usClientState->controllerIndex;

    LPC17_Interrupt_Activate(USB_IRQn, (uint32_t*)&LPC17_UsbDevice_InterruptHandler, 0);

    for (int32_t i = 0; i < LPC17_USB_ENDPOINT_COUNT; i++)
        EndpointInit[i].word = 0;       // All useable endpoints initialize to unused

    for (auto pipe = 0; pipe < LPC17_USB_ENDPOINT_COUNT; pipe++) {
        auto idx = 0;
        if (usClientState->pipes[pipe].RxEP != USB_ENDPOINT_NULL) {
            idx = usClientState->pipes[pipe].RxEP;
            EndpointInit[idx].bits.ED = 0;
            EndpointInit[idx].bits.DE = 0;
        }

        if (usClientState->pipes[pipe].TxEP != USB_ENDPOINT_NULL) {
            idx = usClientState->pipes[pipe].TxEP;
            EndpointInit[idx].bits.ED = 1;
            EndpointInit[idx].bits.DE = 1;
        }

        if (idx != 0) {
            EndpointInit[idx].bits.EN = idx;
            EndpointInit[idx].bits.IN = 0;//itfc->bInterfaceNumber;
            EndpointInit[idx].bits.ET = USB_ENDPOINT_ATTRIBUTE_BULK & 0x03; //ep->bmAttributes & 0x03;
            EndpointInit[idx].bits.CN = 1;        // Always only 1 configuration = 1
            EndpointInit[idx].bits.AISN = 0;        // No alternate interfaces
            EndpointInit[idx].bits.EE = 1;        // Enable this endpoint
            EndpointInit[idx].bits.MPS = usClientState->maxEndpointsPacketSize[idx];
        }
    }

    usClientState->firstGetDescriptor = true;

    LPC17_UsbDevice_ProtectPins(controllerIndex, true);

    return true;
}

bool LPC17_UsbDevice_Uninitialize(UsClientState *usClientState) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    LPC17_Interrupt_Deactivate(USB_IRQn);

    if (usClientState != nullptr) {
        LPC17_UsbDevice_ProtectPins(usClientState->controllerIndex, false);
        usClientState->currentState = USB_DEVICE_STATE_UNINITIALIZED;
    }

    return true;
}

bool LPC17_UsbDevice_StartOutput(UsClientState* usClientState, int32_t endpoint) {
    int32_t m, n, val;

    DISABLE_INTERRUPTS_SCOPED(irq);

    /* if the halt feature for this endpoint is set, then just
       clear all the characters */
    if (usClientState->endpointStatus[endpoint] & USB_STATUS_ENDPOINT_HALT) {
        TinyCLR_UsbClient_ClearEndpoints(usClientState, endpoint);
        return true;
    }

    //If txRunning, interrupts will drain the queue
    if (!usbDeviceDrivers[usClientState->controllerIndex].txRunning[endpoint]) {
        usbDeviceDrivers[usClientState->controllerIndex].txRunning[endpoint] = true;

        // Calling both LPC17_UsbDevice_TxPacket & EP_TxISR in this routine could cause a TX FIFO overflow
        LPC17_UsbDevice_TxPacket(usClientState, endpoint);
    }
    else if (irq.IsDisabled()) {

        n = LPC17_UsbDevice_EPAdr(endpoint, 1); // It is an output endpoint for sure
        if ((USBEpIntSt & (1 << n)))//&& (USBEpIntEn & (1 << n)) )//only if enabled
        {
            m = n >> 1;

            if (m == 0)//EP0
            {
                USBEpIntClr = 1 << n;
                while ((USBDevIntSt & CDFULL_INT) == 0);
                val = USBCmdData;

                if (val & EP_SEL_STP)        /* Setup Packet */
                {
                    LPC17_UsbDevice_ProcessEP0(usClientState, 0, 1);// out setup
                }
                else {
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        LPC17_UsbDevice_ProcessEP0(usClientState, 0, 0);// out not setup
                    }
                    else {
                        LPC17_UsbDevice_ProcessEP0(usClientState, 1, 0);// in not setup
                    }
                }
            }
            else {
                if (usClientState->queues[m] && usClientState->isTxQueue[endpoint])
                    LPC17_UsbDevice_ProcessEndPoint(usClientState, m, 1);//out
                else
                    LPC17_UsbDevice_ProcessEndPoint(usClientState, m, 0);//in
            }
        }
    }

