ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_UsbDevice.cpp
    return true;
}

bool LPC17_UsbDevice_RxEnable(UsClientState* usClientState, int32_t endpoint) {
    if (endpoint >= LPC17_USB_ENDPOINT_COUNT)
        return false;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (nacking_rx_OUT_data[endpoint])
        LPC17_UsbDevice_Enpoint_RxInterruptHandler(usClientState, endpoint);//force interrupt to read the pending EP

    return true;
}

static uint8_t  LPC17_UsbDevice_DeviceAddress = 0;

#define CONTORL_EP_ADDR	0x80

#define USB_POWER           0
#define USB_IF_NUM          4
#define USB_EP_NUM          32
#define USB_MAX_PACKET0     64
#define USB_DMA             0
#define USB_DMA_EP          0x00000000

#define USB_POWER_EVENT     0
#define USB_RESET_EVENT     1
#define USB_WAKEUP_EVENT    0
#define USB_SOF_EVENT       0
#define USB_ERROR_EVENT     0
#define USB_EP_EVENT        0x0003
#define USB_CONFIGURE_EVENT 1
#define USB_INTERFACE_EVENT 0
#define USB_FEATURE_EVENT   0

#define EP_MSK_CTRL 0x0001      /* Control Endpoint Logical address Mask */
#define EP_MSK_BULK 0xC924      /* Bulk Endpoint Logical address Mask */
#define EP_MSK_INT  0x4492      /* Interrupt Endpoint Logical address Mask */
#define EP_MSK_ISO  0x1248      /* Isochronous Endpoint Logical address Mask */

static void LPC17_UsbDevice_WrCmd(uint32_t cmd) {
    USBDevIntClr = CCEMTY_INT | CDFULL_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
}
static void LPC17_UsbDevice_WrCmdDat(uint32_t cmd, uint32_t val) {
    USBDevIntClr = CCEMTY_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
    USBDevIntClr = CCEMTY_INT;
    USBCmdCode = val;
    while ((USBDevIntSt & CCEMTY_INT) == 0);
}
static uint32_t LPC17_UsbDevice_RdCmdDat(uint32_t cmd) {
    USBDevIntClr = CCEMTY_INT | CDFULL_INT;
    USBCmdCode = cmd;
    while ((USBDevIntSt & CDFULL_INT) == 0);
    return (USBCmdData);
}

static void LPC17_UsbDevice_SetAddress(uint32_t adr) {
    LPC17_UsbDevice_WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /* Don't wait for next */
    LPC17_UsbDevice_WrCmdDat(CMD_SET_ADDR, DAT_WR_BYTE(DEV_EN | adr)); /*  Setup Status Phase */
}

static void LPC17_UsbDevice_HardwareReset(void) {
    USBEpInd = 0;
    USBEpMaxPSize = USB_MAX_PACKET0;
    USBEpInd = 1;
    USBEpMaxPSize = USB_MAX_PACKET0;

    while ((USBDevIntSt & EP_RLZED_INT) == 0);

    USBEpIntClr = 0xFFFFFFFF;
    USBEpIntEn = 0xFFFFFFFF ^ USB_DMA_EP;
    USBDevIntClr = 0xFFFFFFFF;
    USBDevIntEn = DEV_STAT_INT | EP_SLOW_INT |
        (USB_SOF_EVENT ? FRAME_INT : 0) |
        (USB_ERROR_EVENT ? ERR_INT : 0);

}

void LPC17_UsbDevice_Connect(bool con) {
    LPC17_UsbDevice_WrCmdDat(CMD_SET_DEV_STAT, DAT_WR_BYTE(con ? DEV_CON : 0));
}

uint32_t LPC17_UsbDevice_EPAdr(uint32_t EPNum, int8_t in) {
    uint32_t val;

    val = (EPNum & 0x0F) << 1;
    if (in) {
        val += 1;
    }
    return (val);
}

static uint32_t USB_WriteEP(uint32_t EPNum, uint8_t *pData, uint32_t cnt) {
    uint32_t n, g;
    USBCtrl = ((EPNum & 0x0F) << 2) | CTRL_WR_EN;

    USBTxPLen = cnt;

    for (n = 0; n < (cnt + 3) / 4; n++) {
        g = *(pData + 3);
        g <<= 8;
        g |= *(pData + 2);
        g <<= 8;
        g |= *(pData + 1);
        g <<= 8;
        g |= *pData;
        USBTxData = g;
        pData += 4;
    }

    USBCtrl = 0;

    LPC17_UsbDevice_WrCmd(CMD_SEL_EP(LPC17_UsbDevice_EPAdr(EPNum, 1)));
    LPC17_UsbDevice_WrCmd(CMD_VALID_BUF);

    return (cnt);
}

static uint32_t LPC17_UsbDevice_ReadEP(uint32_t EPNum, uint8_t *pData) {
    uint32_t cnt, n, d;

    USBCtrl = ((EPNum & 0x0F) << 2) | CTRL_RD_EN;

    do {
        cnt = USBRxPLen;
    } while ((cnt & PKT_RDY) == 0);

    cnt &= PKT_LNGTH_MASK;

    for (n = 0; n < (cnt + 3) / 4; n++) {
        d = USBRxData;
        *pData++ = d;
        *pData++ = d >> 8;
        *pData++ = d >> 16;
        *pData++ = d >> 24;
    }

    USBCtrl = 0;

    if (((EP_MSK_ISO >> EPNum) & 1) == 0)    /* Non-Isochronous Endpoint */
    {
        LPC17_UsbDevice_WrCmd(CMD_SEL_EP(LPC17_UsbDevice_EPAdr(EPNum, 0)));
        LPC17_UsbDevice_WrCmd(CMD_CLR_BUF);
    }

    return (cnt);
}

static void LPC17_UsbDevice_SetStallEP(uint32_t EPNum, int8_t in) {
    LPC17_UsbDevice_WrCmdDat(CMD_SET_EP_STAT(LPC17_UsbDevice_EPAdr(EPNum, in)), DAT_WR_BYTE(EP_STAT_ST));
}

void LPC17_UsbDevice_ProcessEndPoint(UsClientState* usClientState, int32_t ep, int32_t in) {
    int32_t val;

    if (in) {
        LPC17_UsbDevice_Enpoint_TxInterruptHandler(usClientState, ep);
    }
    else {
        USBEpIntClr = 1 << LPC17_UsbDevice_EPAdr(ep, in);
        while ((USBDevIntSt & CDFULL_INT) == 0);
        val = USBCmdData;
        LPC17_UsbDevice_Enpoint_RxInterruptHandler(usClientState, ep);
    }
}

void LPC17_UsbDevice_ConfigEP(uint8_t ep_addr, int8_t in, uint8_t size) {
    uint32_t num;

    num = LPC17_UsbDevice_EPAdr(ep_addr, in);
    USBReEp |= (1 << num);
    USBEpInd = num;
    USBEpMaxPSize = size;

    while ((USBDevIntSt & EP_RLZED_INT) == 0);

    USBDevIntClr = EP_RLZED_INT;
}
void LPC17_UsbDevice_EnableEP(uint32_t EPNum, int8_t in) {
    LPC17_UsbDevice_WrCmdDat(CMD_SET_EP_STAT(LPC17_UsbDevice_EPAdr(EPNum, in)), DAT_WR_BYTE(0));
}
void USB_DisableEP(int32_t EPNum, int8_t in) {
    LPC17_UsbDevice_WrCmdDat(CMD_SET_EP_STAT(LPC17_UsbDevice_EPAdr(EPNum, in)), DAT_WR_BYTE(EP_STAT_DA));
}
void LPC17_UsbDevice_ResetEP(uint32_t EPNum, int8_t in) {
    LPC17_UsbDevice_WrCmdDat(CMD_SET_EP_STAT(LPC17_UsbDevice_EPAdr(EPNum, in)), DAT_WR_BYTE(0));
}

void USB_HW_Configure(bool cfg) {
    LPC17_UsbDevice_WrCmdDat(CMD_CFG_DEV, DAT_WR_BYTE(cfg ? CONF_DVICE : 0));

    USBReEp = 0x00000003;
    while ((USBDevIntSt & EP_RLZED_INT) == 0);
    USBDevIntClr = EP_RLZED_INT;
}

void LPC17_UsbDevice_StartHardware() {
    *(uint32_t*)0x400FC0C4 |= 0x80000000;
    USBClkCtrl = (1 << 1) | (1 << 3) | (1 << 4);

    OTGClkCtrl = 0x1F;
    while ((OTGClkSt & 0x1F) != 0x1F);

    LPC17_Gpio_ConfigurePin(14, LPC17_Gpio_Direction::Input, LPC17_Gpio_PinFunction::PinFunction3, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
    LPC17_Gpio_ConfigurePin(31, LPC17_Gpio_Direction::Input, LPC17_Gpio_PinFunction::PinFunction1, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);

    OTGStCtrl |= 3;

