ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_UsbDevice.cpp
    LPC17_UsbDevice_HardwareReset();
    LPC17_UsbDevice_SetAddress(0);

    USBDevIntEn = DEV_STAT_INT;	/* Enable Device Status Interrupt */

    LPC17_UsbDevice_Connect(false);
    // delay if removed and then connected...
    LPC17_Time_Delay(nullptr, 120 * 1000);

    LPC17_UsbDevice_Connect(true);
}

void LPC17_UsbDevice_StopHardware() {
    LPC17_UsbDevice_Connect(false);
}

void LPC17_UsbDevice_TxPacket(UsClientState* usClientState, int32_t endpoint) {
    DISABLE_INTERRUPTS_SCOPED(irq);

    // transmit a packet on UsbPortNum, if there are no more packets to transmit, then die
    USB_PACKET64* Packet64;

    for (;;) {
        Packet64 = TinyCLR_UsbClient_TxDequeue(usClientState, endpoint);

        if (Packet64 == nullptr || Packet64->Size > 0) {
            break;
        }
    }

    if (Packet64) {

        USB_WriteEP(endpoint, Packet64->Buffer, Packet64->Size);

        usbDeviceDrivers[usClientState->controllerIndex].txNeedZLPS[endpoint] = false;
        if (Packet64->Size == 64)
            usbDeviceDrivers[usClientState->controllerIndex].txNeedZLPS[endpoint] = true;
    }
    else {
        // send the zero length packet since we landed on the FIFO boundary before
        // (and we queued a zero length packet to transmit)
        if (usbDeviceDrivers[usClientState->controllerIndex].txNeedZLPS[endpoint]) {
            USB_WriteEP(endpoint, (uint8_t*)nullptr, 0);
            usbDeviceDrivers[usClientState->controllerIndex].txNeedZLPS[endpoint] = false;
        }

        // no more data
        usbDeviceDrivers[usClientState->controllerIndex].txRunning[endpoint] = false;
    }
}
void LPC17_UsbDevice_ControlNext(UsClientState *usClientState) {
    if (usClientState->dataCallback) {
        // this call can't fail
        usClientState->dataCallback(usClientState);

        if (usClientState->dataSize == 0) {
            USB_WriteEP(CONTORL_EP_ADDR, (uint8_t*)nullptr, 0);
            usClientState->dataCallback = nullptr;                         // Stop sending stuff if we're done
        }
        else {
            USB_WriteEP(CONTORL_EP_ADDR, usClientState->ptrData, usClientState->dataSize);

            if (usClientState->dataSize < LPC17_USB_ENDPOINT_SIZE) // If packet is less than full length
            {
                usClientState->dataCallback = nullptr; // Stop sending stuff if we're done
            }

            // special handling the USB state set address test, cannot use the first descriptor as the ADDRESS state is handle in the hardware
            if (usbDeviceDrivers[usClientState->controllerIndex].firstDescriptorPacket) {
                usClientState->dataCallback = nullptr;
            }

        }
    }
}

#define USB_USBCLIENT_ID 0
void LPC17_UsbDevice_InterruptHandler(void* param) {
    DISABLE_INTERRUPTS_SCOPED(irq);
    int32_t disr, val, n, m;

    disr = USBDevIntSt;                      /* Device Interrupt Status */
    USBDevIntClr = disr;                       /* A known issue on LPC214x */

    UsClientState *usClientState = usbDeviceDrivers[USB_USBCLIENT_ID].usClientState;

    if (disr & DEV_STAT_INT) {
        LPC17_UsbDevice_WrCmd(CMD_GET_DEV_STAT);
        val = LPC17_UsbDevice_RdCmdDat(DAT_GET_DEV_STAT);       /* Device Status */

        if (val & DEV_RST)                     /* Reset */
        {
            LPC17_UsbDevice_ResetEvent(usClientState);
        }

        if (val & DEV_SUS_CH)                  /* Suspend/Resume */
        {
            if (val & DEV_SUS)                   /* Suspend */
            {
                LPC17_UsbDevice_SuspendEvent(usClientState);
            }
            else                               /* Resume */
            {
                LPC17_UsbDevice_ResumeEvent(usClientState);
            }
        }

        goto isr_end;
    }

    /* Endpoint's Slow Interrupt */
    if (disr & EP_SLOW_INT) {
        for (n = 0; n < USB_EP_NUM; n++)     /* Check All Endpoints */
        {
            if ((USBEpIntSt & (1 << n))) {
                m = n >> 1;

                if (m == 0)//EP0
                {
                    USBEpIntClr = 1 << n;
                    while ((USBDevIntSt & CDFULL_INT) == 0);
                    val = USBCmdData;

                    if (val & EP_SEL_STP)        /* Setup Packet */
                    {
                        LPC17_UsbDevice_ProcessEP0(usClientState, 0, 1);// out setup
                        continue;
                    }
                    if ((n & 1) == 0)                /* OUT Endpoint */
                    {
                        LPC17_UsbDevice_ProcessEP0(usClientState, 0, 0);// out not setup
                    }
                    else {
                        LPC17_UsbDevice_ProcessEP0(usClientState, 1, 0);// in not setup
                    }

                    continue;
                }
                if ((n & 1) == 0)                /* OUT Endpoint */
                {
                    LPC17_UsbDevice_ProcessEndPoint(usClientState, m, 0);//out
                }
                else                           /* IN Endpoint */
                {
                    LPC17_UsbDevice_ProcessEndPoint(usClientState, m, 1);//in
                }
            }
        }
    }
isr_end:
    return;
}

void LPC17_UsbDevice_ProcessEP0(UsClientState *usClientState, int32_t in, int32_t setup) {
    uint32_t EP_INTR;
    int32_t i;

    DISABLE_INTERRUPTS_SCOPED(irq);

    if (setup) {
        uint8_t   len = 0;

        len = LPC17_UsbDevice_ReadEP(0x00, usClientState->controlEndpointBuffer);

        // special handling for the very first SETUP command - Getdescriptor[DeviceType], the host looks for 8 bytes data only
        TinyCLR_UsbClient_SetupPacket* Setup = (TinyCLR_UsbClient_SetupPacket*)&usClientState->controlEndpointBuffer[0];
        if ((Setup->Request == USB_GET_DESCRIPTOR) && (((Setup->Value & 0xFF00) >> 8) == USB_DEVICE_DESCRIPTOR_TYPE) && (Setup->Length != 0x12))
            usbDeviceDrivers[usClientState->controllerIndex].firstDescriptorPacket = true;
        else
            usbDeviceDrivers[usClientState->controllerIndex].firstDescriptorPacket = false;

        // send it to the upper layer
        usClientState->ptrData = &usClientState->controlEndpointBuffer[0];
        usClientState->dataSize = len;

        uint8_t result = TinyCLR_UsbClient_ControlCallback(usClientState);

        switch (result) {
        case USB_STATE_ADDRESS:
            LPC17_UsbDevice_DeviceAddress = usClientState->address | 0x80;
            break;

